Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: བསྐལ་བ་བྱེ་བར་ཆོས་རྙེད་རབ་ཏུ་དཀའ། །
en: Please listen! The Dharma is hard to find in millions of eons.

source: དེ་རྙེད་ནས་ནི་བྱང་ཆུབ་མ་ཐོབ་པར། །མཁས་པ་དག་ནི་གཞར་ཡང་མི་གཏོང་ངོ་། །
en: Having found it, the wise never let it go Until they have achieved awakening.

source: སངས་རྒྱས་འབྱུང་བ་རྟག་ཏུ་རབ་རྙེད་དཀའ། །
en: “ ‘The appearance of a buddha is always so rare.

source: ཕ་མ་དག་ནི་ཆོས་ལ་གནས་པ་དང་། །
en: So, too, are parents involved in the Dharma,

source: དལ་བ་འབྱོར་དང་ཆོས་འདོད་གྲོགས་པོ་དང་། །
en: Time to practice, and friends who love the Dharma.

source: འཐུན་པར་གནས་དང་བསྟན་ལ་དད་རབ་དཀོན། །
en: Having faith in the teaching and living accordingly are so rare.

source: འདུན་དང་བརྩོན་འགྲུས་དེ་བཞིན་བག་ཡོད་དང་། །
en: “ ‘Zeal, heroic courage, as well as care;

source: རབ་ཏུ་བྱུང་ཐོབ་རྟག་ཏུ་ཤེས་བཞིན་ཅན། །
en: Taking monastic vows and being self-aware;

source: ཕན་པའི་དངོས་དང་མཉེན་དང་མ་ཁེངས་དང་། །
en: Truly being of benefit, flexibility, humility,

source: ངོ་ཚ་ཁྲེལ་ཡོད་ཐོས་དང་ཚུལ་ཁྲིམས་བཟང་། །
en: Shame and modesty, learning, good habits,

source: ཞི་དུལ་སྲོག་ཆགས་རྣམས་ལ་སྙིང་རྗེ་བྱམས། །
en: “ ‘Gentleness, compassion toward beings,

source: ཟབ་མོའི་ཆོས་ལ་ཆོས་ཀྱི་བཟོད་ལྡན་དང་། །
en: Acceptance of reality and of the profound Dharma,

source: བརྩོན་འགྲུས་མཐུ་དང་སེམས་ནི་མ་ཞུམ་དང་། །
en: Effort, strength, joy, and an optimistic attitude;

source: བསྡུ་བས་སེམས་ཅན་ཡོངས་སུ་སྨིན་བྱེད་དང་། །
en: Bringing beings to maturity by drawing them to oneself;

source: སེམས་ལས་རུང་ཞིང་དབེན་པར་གནས་པ་དང་། །
en: “ ‘And with a suitable mind and a place of solitude,

source: ལུས་དང་དེ་བཞིན་སྲོག་ལ་མི་ལྟ་དང་། །
en: And with little regard for life and limb,

source: མགོ་དང་གོས་ལ་འབར་ལྟར་ཆོས་སེམས་པ། །
en: Thinking of the Dharma as if one’s head and clothes were on fire—

source: དེ་དག་སངས་རྒྱས་ཡོན་ཏན་དེ་འདྲ་འཐོབ། །
en: They will attain the qualities of the buddhas like these ones.

source: བདག་ཅག་ཆོས་མཆོག་གང་དག་རབ་བརྗོད་པ། །
en: “ ‘We have spoken of the supreme Dharma,

source: ཆོས་མཆོག་དེ་དག་ཡབ་གཅིག་རབ་རྙེད་དཀའ། །
en: Dear Papa, a supreme Dharma that is hard to find,

source: ཆོས་རྣམས་དེ་དག་དོན་དུ་བདག་ཅག་ལྷགས། །
en: Such that those like us, who come seeking this Dharma,

source: ང་ནི་རྒྱལ་བའི་དྲུང་དུ་བཞུད་པར་བགྱི། །
en: Are compelled to go into the presence of the victorious ones.

source: དཀར་པོའི་ཆོས་རྣམས་ཀྱིས་ནི་ཡོངས་ཟིན་ཅིང་། །
en: “ ‘When one comes into contact with virtuous qualities,

source: སྐད་ཅིག་གིས་ནི་མངོན་ཤེས་ལྔ་ཐོབ་པ། །
en: One attains the five supernormal faculties in an instant;

source: རྗེས་སུ་དྲན་པ་སྒོམ་ཞིང་ཡེ་ཤེས་ཅན། །
en: One develops mindfulness and one becomes full of knowledge.’

source: བྱང་ཆུབ་སེམས་དཔའ་མཁས་པ་དེ་གཉིས་དོང་། །
en: So said these two wise bodhisattvas who had arisen there.

source: རྒྱལ་པོ་བུ་དང་བཅས་ཤིང་བུད་མེད་བཅས། །
en: “The king, his sons and daughters,

source: བྱང་ཆུབ་སེམས་དཔའ་མངོན་ཤེས་ཐོབ་མཁས་གཉིས། །
en: And the two skilled bodhisattvas who had obtained supernormal faculties

source: སྟོན་པ་ཡོན་ཏན་རྒྱལ་མཆོག་ག་ལ་བར། །ནམ་མཁའ་ལས་ནི་དེར་ཡང་མངོན་དུ་དོང་། །
en: Flew through the sky and alighted In the presence of the Teacher, the virtuous Supreme Victor.

source: དེ་བཞིན་གཤེགས་པའི་ཞབས་ལ་ཕྱག་འཚལ་ཏེ། །
en: “They bowed at the feet of the Realized One,

source: ཐམས་ཅད་འདུས་ནས་གུས་དང་བཅས་པར་གནས། །
en: And gathered together there, sitting respectfully.

source: དེ་ནས་རྒྱལ་སྲས་ཆོས་ཀྱི་བློ་གྲོས་སྨྲས། །
en: Prince Dharmamati then made a request:

source: བྱང་ཆུབ་ལམ་དེ་བདག་ཅག་བཤད་དུ་གསོལ། །
en: ‘We ask you to describe the path to awakening.’

source: ཟབ་མོའི་ཆོས་ཀྱི་གཏམ་ནི་རབ་གསུངས་པ། །
en: And thus gave a telling of the profound Dharma:

source: ཆོས་རྣམས་འདི་དག་བརྟེན་ནས་བྱུང་བ་སྟེ། །
en: ‘Those things that arise in dependence on other things

source: བདག་པོ་མེད་ཅིང་བྱེད་པ་པོ་དང་བྲལ། །
en: Do not have a controller and they do not have a creator.

source: ནམ་ཡང་སྟོང་ཞིང་ཕྱི་རོལ་རྒྱུ་བ་མེད། །
en: “ ‘They are eternally empty and have no external mover.

source: ཆོས་རྣམས་འདི་དག་གསོག་དང་གསོབ་ཡིན་ཏེ། །
en: These things are hollow and worthless.

source: ལྟ་དང་བྱ་བ་དག་ཅིང་གཡོ་བ་མེད། །
en: They are free from opinion and action and do not waver.

source: ནམ་མཁའ་ལྟ་བུར་རྟག་ཏུ་གཟུང་དུ་མེད། །
en: Like space, they can never be grasped.’

source: བདེ་བར་གཤེགས་པས་ཆོས་གཏམ་རྣམ་དག་པ། །
en: “When the Sublime One gave this brilliant telling

source: རྣམ་པ་མང་པོ་དེ་དག་རྣམས་ལ་བཤད། །
en: Of the Dharma in its many aspects,

source: བྱེ་བ་ཕྲག་གསུམ་ཁྲག་ཁྲིག་བདུན་ཅུ་དྲུག །
en: Seven hundred sixty billion, thirty million beings

source: མི་སྐྱེ་བཟོད་པ་རྗེས་སུ་ཐོབ་པར་གྱུར། །
en: Attained acceptance of the fact that things do not arise.

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་བཅོམ་ལྡན་འདས་དེ་ལ་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་གིས་ཞག་བདུན་གྱི་བར་དུ་མཆོད་པ་བྱས་ནས་བཙུན་མོའི་འཁོར་དང་བཅས། གཉེན་གྱི་འཁོར་དང་བཅས་ཏེ་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་རང་གི་ཁྱིམ་དུ་སླར་ཕྱིན་ཏོ། །
en: “In this way, Śāntamati, King Dhṛtarāṣṭra and the women from the king’s inner chambers and his relatives spent seven days venerating the Blessed One, following which they all went home together at the same time.

source: ཞི་བའི་བློ་གྲོས་དེ་ནས་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་གཅིག་པུ་དབེན་པར་སོང་སྟེ།
en: Afterward, Śāntamati, King Dhṛtarāṣṭra went into solitude.

source: བཀོད་པ་ཆེན་པོའི་ཁང་པ་བརྩེགས་པར་སེང་གེའི་ཁྲི་པད་མའི་འབྱུང་གནས་བཟང་པོ་ལ་འདུག་ནས་ནང་དུ་ཡང་དག་པར་བཞག་ཅིང་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གི་གཞོན་ནུ་འདི་དག་ཐམས་ཅད་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡང་དག་པར་ཞུགས་པ་ཤ་སྟག་ན། གཞོན་ནུ་འདི་དག་ཐམས་ཅད་ཀྱི་ནང་ན་གང་ཐོག་མར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་བདག་གིས་བརྟག་གོ་སྙམ་མོ། །
en: He went to the hugely arrayed pavilion where he sat upon the fine lion’s seat arrayed with lotus flowers, and, establishing himself completely within himself, he thought to himself, ‘All of my children have become set on attaining unsurpassable and perfect awakening, so I should investigate which one of them will be the first directly to realize unsurpassable and perfect awakening in all its fullness.’

source: དེ་ནས་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་གིས་དེའི་མོད་ལ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་བུམ་པ་བྱེད་དུ་བཅུག་སྟེ།
en: “Right away, King Dhṛtarāṣṭra took out a vase made of seven precious substances.

source: བྱི་དོར་ལེགས་པར་བྱས་ཤིང་ལེགས་པར་ཟིན་པར་བྱས་ནས་གཞོན་ནུ་དེ་དག་ཐམས་ཅད་ཀྱི་མིང་བྲིས་ཏེ་བུམ་པ་དེའི་ནང་དུ་བཅུག་ནས་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་པད་མ་སྣ་ཚོགས་བལྟ་ན་སྡུག་པ་བྱས་ནས་པད་མ་དེའི་སྟེང་དུ་བུམ་པ་དེ་བཞག་སྟེ།
en: He cleaned the vase and took it in his hands, and after he had written down the names of every one of his children, he put the names in the vase.

source: ཞག་བདུན་དུ་ལྷའི་མཆོད་པ་མེ་ཏོག་ཐམས་ཅད་དང་། སྤོས་ཐམས་ཅད་དང་། ཕྱེ་མ་ཐམས་ཅད་དང་།
en: He then set the vase upon a ravishingly beautiful multicolored lotus flower made of the seven precious substances, and for seven days, the gods worshiped it with various types of flowers, incense, powders, fragrances, scented oils, and music.

source: བདུག་པ་ཐམས་ཅད་དང་། བྱུག་པ་ཐམས་ཅད་དང་། རོལ་མོའི་སིལ་སྙན་ཐམས་ཅད་ཀྱིས་མཆོད་དོ། །མིང་དེ་དག་མཆོད་པའི་ཚེ་ན་ལྷའི་བུ་ཁྲི་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་བརྩོན་པར་གྱུར་ཏོ། །
en: During the worship of the names, ten thousand gods engaged in their worship.

source: ཞག་བདུན་དུ་མཆོད་པ་བྱས་ནས་བཙུན་མོའི་འཁོར་དང་། དེའི་བུ་སྟོང་དང་།
en: After the seven days of worship, the vase was placed upon a golden pedestal in front of the king, his queens, their one thousand sons, and the two boys.

source: གཞོན་ནུ་དེ་གཉིས་ཀྱི་མདུན་དུ་ཐམས་ཅད་གསེར་ལས་བྱས་པའི་ཁྲིའུ་བཟང་པོའི་སྟེང་དུ་བུམ་པ་དེ་བཞག་ནས་ནང་གི་མིས་བུམ་པ་དེའི་ནང་ནས་མིང་དེ་རྣམས་ཕྱུང་ངོ་། །
en: The family members then began removing names from the vase.

source: ཞི་བའི་བློ་གྲོས་དེའི་ཚེ་ཐམས་ཅད་ཀྱི་ཐོག་མར་རྒྱལ་བུ་གཞོན་ནུ་རྣམ་པར་དག་པའི་བློ་གྲོས་ཞེས་བྱ་བ་དེའི་མིང་བྱུང་བར་གྱུར་ཏོ། །
en: “Of all the princes, Śāntamati, the first name they drew was Prince Viśuddhamati.

source: མིང་དེ་བྱུང་མ་ཐག་ཏུ་སྐད་ཅིག་དེ་ཉིད་ལས་ཆེན་པོ་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་སོ། །
en: As soon as the name was drawn, the great earth trembled in six ways.

source: བཙུན་མོའི་འཁོར་ཐམས་ཅད་ཀྱི་བང་ན་སིལ་སྙན་ཡོད་པ་དེ་དག་ཀྱང་མ་དཀྲོལ་བར་བྱེ་བ་ཕྲག་དུ་མའི་སྒྲ་བྱུང་ངོ་། །
en: Without being rung, the cymbals on the laps of the women in the assembly resounded with many hundreds of tones.

source: ཞི་བའི་བློ་གྲོས་འདི་ཇི་སྙམ་དུ་སེམས།
en: “Śāntamati, what do you think?

source: ཞི་བའི་བློ་གྲོས་དེའི་ཚེ་དེའི་དུས་ན་ཐམས་ཅད་ཀྱི་ཐོག་མར་མིང་བྱུང་བ་རྒྱལ་བུ་གཞོན་ནུ་རྣམ་པར་དག་པའི་བློ་གྲོས་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་དེ་ལྟར་མི་བལྟའོ། །
en: Śāntamati, you should not think that Viśuddhamati, whose name was drawn first at that time, is someone unknown to you.

source: དེ་བཞིན་གཤེགས་པ་འཁོར་བ་འཇིག་དེ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་བུ་གཞོན་ནུ་རྣམ་པར་དག་པའི་བློ་གྲོས་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: Because the prince known then as Viśuddhamati later became the blessed one Krakucchanda.

source: དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བའི་སྡེ་ཞེས་བྱ་བ་དེའི་མིང་བྱུང་སྟེ།
en: Following that, Prince Vijayasena’s name was drawn.

source: བཅོམ་ལྡན་འདས་གསེར་ཐུབ་དེ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་བུ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བའི་སྡེ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: The prince known then as Vijayasena later became the blessed one Kanakamuni.

source: དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་དབང་པོ་ཞི་བ་ཞེས་བྱ་བ་དེའི་མིང་བྱུང་སྟེ།
en: Following that, Prince Peaceful Lord’s name was drawn.

source: བཅོམ་ལྡན་འདས་འོད་སྲུང་དེ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་བུ་གཞོན་ནུ་དབང་པོ་ཞི་བ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: This prince then known as Peaceful Lord later became the blessed one Kāśyapa.

source: དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་ཞེས་བྱ་བ་དེའི་མིང་བྱུང་ངོ་། །
en: Following that, the prince Sarvārthasiddha’s name was drawn.

source: དེ་ནི་ང་ཡིན་ཏེ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་བུ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: I am the one who at that point was the prince called Sarvārthasiddha.

source: དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་སྐ་རགས་ཅན་ཞེས་བྱ་བའི་མིང་བྱུང་བར་གྱུར་ཏེ།
en: “Following that, the prince Sash Wearer’s name was drawn.

source: དེ་ནི་བྱམས་པ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །
en: He will become the realized one Maitreya.

source: དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་མཆོག་གི་བློ་གྲོས་ཞེས་བྱ་བ་དེའི་མིང་བྱུང་སྟེ།
en: Following that, the prince Supreme Intellect’s name was drawn.

source: དེ་ནི་སེང་གེ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །
en: He will become the realized one Siṃha.

source: དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་གློག་གི་ལྷ་ཞེས་བྱ་བ་དེའི་མིང་བྱུང་སྟེ།
en: Following that, the prince Vidyuddeva’s name was drawn.

source: དེ་ནི་ཏོག་ཅེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །
en: He will become the realized one Ketu.

source: དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་བཟང་པོའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་མིང་བྱུང་སྟེ།
en: Following that, the prince Excellent King’s name was drawn.

source: དེ་ནི་མེ་ཏོག་དམ་པ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །
en: He will become the realized one Kusumottama.

source: དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་འོད་ཀྱི་དཔལ་ཞེས་བྱ་བའི་མིང་བྱུང་སྟེ།
en: Following that, the prince Prabhāketu’s name was drawn.

source: དེ་ནི་མེ་ཏོག་ཅེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །
en: He will become the realized one Puṣpa.

source: དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་རྣམ་པར་སྣང་བའི་པད་མ་ཞེས་བྱ་བའི་མིང་བྱུང་སྟེ།
en: Following that, the prince Vimalaprabhāsa’s name was drawn.

source: དེ་ནི་སྐར་མ་རྒྱལ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །
en: He will become the realized one Sunetra.

source: དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་དྲི་མ་མེད་པའི་འོད་ཅེས་བྱ་བའི་མིང་བྱུང་སྟེ།
en: Following that, the prince Vimalaprabhāsa’s name was drawn.

source: དེ་ནི་སྤྱན་ལེགས་པ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །
en: He will become the realized one Beautiful Eyes.

source: དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་རྡུལ་མེད་ཅེས་བྱ་བའི་མིང་བྱུང་སྟེ།
en: Following that, the prince Pareṇareṇu’s name was drawn.

source: དེ་ནི་ལག་བཟངས་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །
en: He will become the realized one Subāhu.

source: དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་བློ་གྲོས་རྒྱལ་པོ་ཞེས་བྱ་བའི་མིང་བྱུང་སྟེ།
en: Following that, the prince Matirāja’s name was drawn.

source: དེ་ནི་འོད་ཅེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །
en: He will become the realized one Jyotis.

source: དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་དགེ་བ་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་མིང་བྱུང་སྟེ།
en: Following that, the prince Śubhavyūha’s name was drawn.

source: དེ་ནི་སྐར་མ་ལ་དགའ་བ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །
en: He will become the realized one Jyotīrasa.

source: དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་ཕྱོགས་འབྱོར་པ་ཞེས་བྱ་བའི་མིང་བྱུང་སྟེ།
en: Following that, the prince Samṛddhapakṣa’s name was drawn.

source: དེ་ནི་མངོན་འཕགས་གཤེགས་པ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །
en: He will become the realized one Abhyupagatagāmin.

source: དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་རྣམ་པར་དག་པ་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་མིང་བྱུང་སྟེ།
en: Following that, the prince Viśuddhavyūharāja’s name was drawn.

source: དེ་ནི་ཡོན་ཏན་གྱི་མཆོག་མངའ་བ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །
en: He will become the realized one Guṇāgradhārin.

source: དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་དཔལ་སྦས་ཞེས་བྱ་བའི་མིང་བྱུང་སྟེ།
en: Following that, the prince Śrīgupta’s name was drawn.

source: དེ་ནི་ནོར་དཔལ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །
en: He will become the realized one Dhanaśrī.

source: དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་ལུས་ཤིན་ཏུ་རྣམ་པར་འབྱེད་པ་ཞེས་བྱ་བའི་མིང་བྱུང་སྟེ།
en: Following that, the prince Suvimuktagātra’s name was drawn.

source: དེ་ནི་ཡེ་ཤེས་འབྱུང་གནས་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །
en: He will become the realized one Jñānākara.

source: དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་དྲག་ཤུལ་ཅན་ཞེས་བྱ་བའི་མིང་བྱུང་སྟེ།
en: Following that, the prince Ugra’s name was drawn.

source: དེ་ནི་རིན་པོ་ཆེ་འབྱུང་གནས་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །
en: He will become the realized one Ratnākara.

source: དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་རིན་ཆེན་གྲགས་པ་ཞེས་བྱ་བའི་མིང་བྱུང་སྟེ།
en: Following that, the prince Ratnakīrti’s name was drawn.

source: དེ་ནི་ཀུན་ཏུ་སྣང་བ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །
en: He will become the realized one Samantāloka.

source: དེ་བཞིན་དུ་རྒྱ་ཆེར་བྱ་སྟེ།
en: This could be done at length.

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་བུ་སྟོང་ཡོད་པ་དེའི་ནང་ནས་གཅིག་བཞག་སྟེ། རྒྱལ་བུ་གཞོན་ནུ་ཅོད་པན་བརྒྱན་པ་ཞེས་བྱ་བའི་མིང་གི་བར་དུ་འབྱུང་ངོ་། །དེ་ནི་ཡོན་ཏན་མཐའ་ཡས་གྲགས་པ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །
en: For in this way, Śāntamati, one was selected for each of the thousand princes, including the name of the penultimate prince Mukuṭālaṃkṛta who will become the realized one Anantaguṇa­kīrti.

source: ཞི་བའི་བློ་གྲོས་དེའི་ཚེ་རྒྱལ་བུ་གཞོན་ནུ་ཐམས་ཅད་ཀྱི་ཐ་ཆུང་ས་བློ་གྲོས་མཐའ་ཡས་ཞེས་བྱ་བ་དེའི་མིང་བྱུང་བར་གྱུར་པ་དང་སྣག་གི་གཉེན་མཚམས་ཐམས་ཅད་དང་།
en: “Finally, Śāntamati, when Anantabuddhi’s name was drawn, all of his kinsmen made fun of him, because he was at the least advanced stage of the bodhisattva path.

source: སྤུན་རྣམས་ན་རེ། གང་གི་ཚེ་བདག་ཅག་ཐམས་ཅད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱས་ཤིང་སངས་རྒྱས་ཀྱི་བྱ་བ་ཐམས་ཅད་བྱས་པ་དེའི་འོག་ཏུ་ཁྱོད་ཀྱིས་ཅི་ཞིག་བྱར་ཡོད་ཅེས་དཔྱས་པ་དང་།
en: They said, ‘After all of us have performed all the deeds of the buddhas and brought all beings to maturity, what will be left for you to do?’

source: བློ་གྲོས་མཐའ་ཡས་ཀྱིས་སྨྲས་པ།
en: “Anantabuddhi replied: “ ‘My understanding is that beings are inexhaustible,

source: སངས་རྒྱས་ཆོས་རྣམས་འདི་དག་ནམ་མཁའ་མཚུངས་ཤིང་འདྲ། །
en: Just as the qualities of the Victor, which are equal to the element of space.

source: བདག་གི་ཡིད་ལ་སེམས་ཅན་ཟད་པ་མེད་སྙམ་བགྱིད། །
en: All of you here, listen to the nature of this vow of mine,

source: ཚུལ་ཁྲིམས་ཀྱིས་ནི་བདག་གི་སྨོན་ལམ་འདིར་དག་འགྱུར། །
en: A vow that will be made pure through my moral conduct.

source: བདག་གི་སྨོན་ལམ་ཅི་འདྲ་ཐམས་ཅད་འདིར་གསོན་ཅིག །ཁྱེད་ཀྱི་ཚེ་ཚད་ཇི་ཙམ་པ་དག་བསྡོམས་པ་དང་། །
en: “ ‘If you were to combine the lifespans of all of you here,

source: ཚོགས་ཀྱི་རྒྱལ་པོ་ཇི་སྙེད་དེ་དག་ཀུན་བསྡོམས་པ། །
en: And added up everyone present before the one called the King of Assemblies,

source: ཐམས་ཅད་བསྡོམས་པ་དེ་སྙེད་བདག་གི་ཚེར་འགྱུར་ཏེ། །
en: Then my lifespan will be equal to all of yours combined,

source: བདག་གི་དགེ་སློང་ཚོགས་ཀྱང་དེ་ཀུན་མ་ལུས་སྙེད། །
en: And my monastic assembly will be equal to that honorable one’s.’

source: དེ་ཡིས་ཚིགས་སུ་བཅད་པ་དེ་ནི་སྨྲས་མ་ཐག །
en: “After he had spoken the preceding verses,

source: དེ་ཡི་ཚེ་ན་ལེགས་ཞེས་ལྷ་ཡིས་སྒྲ་ཕྱུང་སྟེ། །
en: The gods said ‘Excellent!’ and exclaimed,

source: སེམས་ཅན་དག་པ་ཁྱོད་ཀྱིས་བསམ་པ་རྫོགས་གྱུར་ཅིག །
en: ‘Best of beings, may your vow be fulfilled!

source: ཁྱོད་ཀྱིས་ཇི་ལྟར་བསམས་བཞིན་སེམས་ཅན་དོན་མཛོད་ཅིག །
en: May you work for the world’s benefit just as you have wished!’

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་རྒྱལ་བུ་གཞོན་ནུ་ཐམས་ཅད་ཀྱི་ཐ་ཆུངས་སུ་གྱུར་པ་བློ་གྲོས་མཐའ་ཡས་ཞེས་བྱ་བ་དེ་ནི་བསྐལ་པ་བཟང་པོ་འདི་ལ་དེ་བཞིན་གཤེགས་པ་ཐམ་པ་མོས་པ་ཞེས་བྱ་བར་འགྱུར་ཏེ།
en: “Therefore, Śāntamati, the least advanced of all the princes, Anantabuddhi, will become the realized one Roca, who will be the final realized one to appear in this Fortunate Eon.

source: ཞི་བའི་བློ་གྲོས་བསྐལ་པ་བཟང་པོའི་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་ཚེའི་ཚད་ཇི་ཙམ་པ་དང་། ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཇི་སྙེད་པར་འགྱུར་བ་དེ་བཞིན་གཤེགས་པ་མོས་པ་དེའི་ཚེའི་ཚད་ཀྱང་དེ་སྲིད་དུ་འགྱུར། ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཡང་དེ་སྙེད་དུ་འགྱུར་རོ། །
en: Śāntamati, the lifespan of the realized one Roca will be equal to the aggregated lifespans of all the realized ones of the Fortunate Eon, and his assembly of great disciples will be equal to all of theirs.

source: བདག་དེ་ལྟར་མོས་པས་ན་དེའི་ཕྱིར་མོས་པ་ཞེས་བྱའོ། །
en: He said, ‘I long for this,’ and thus he will be called Roca.

source: ཞི་བའི་བློ་གྲོས་འདི་ལྟར་སངས་རྒྱས་སྟོང་དུ་གཅིག་གིས་མ་ཚང་བ་དག་སངས་རྒྱས་ཀྱི་མཛད་པ་ཇི་སྙེད་མཛད་པ་དེ་སྙེད་དེ་བཞིན་གཤེགས་པ་མོས་པས་བྱེད་པར་འགྱུར་བས་ཐབས་མཁས་པའི་ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས་པའི་རྒྱུ་འཐུན་པ།
en: Śāntamati, the realized one Roca will perform all the deeds of a buddha to the same degree that the other nine hundred ninety-nine buddhas will do.

source: སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པའི་ཁྱད་པར་ལ་ལྟོས།
en: This is the particular consequence of his mastery of skill in means and his perfection of moral conduct and of the fulfillment of his vow.

source: ཞི་བའི་བློ་གྲོས་དེ་ནས་གཞོན་ནུ་སྟོང་པོ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་གཞོན་ནུ་ཆོས་སེམས་པ་དང་། ཆོས་ཀྱི་བློ་གྲོས་དང་དེ་གཉིས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱེད་གཉིས་ཀྱིས་སྨོན་ལམ་ཇི་ལྟ་བུ་ཞིག་བཏབ། ཆོས་སེམས་པས་སྨྲས་པ།
en: “Then, Śāntamati, the one thousand princes all asked the young bodhisattvas, Dharmacinti and Dharmamati, ‘Noble sons, what sorts of vows have you made?’

source: གྲོགས་པོ་དག་བདག་ནི་ཁྱེད་ཐམས་ཅད་ཀྱི་ལག་ན་རྡོ་རྗེར་གྱུར་ཏེ། ནང་ན་སྤྱོད་ཅིང་དེ་བཞིན་གཤེགས་པའི་གསང་བ་ཐམས་ཅད་ལས་ཕྱི་རོལ་དུ་མ་གྱུར་ལ་ཕྱི་ནང་གི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཉན་པ་དང་། མོས་པ་དང་། རྟོགས་པ་དེ་ལྟར་བདག་སྨོན་ལམ་འདེབས་སོ། །
en: “Dharmacinti responded, ‘Friends, I have vowed to become a Vajrapāṇi for each of you, uninterruptedly and without exception, so that I may reveal the secrets of the realized ones, and so that I may hear the teachings of all the buddhas, adhere to them, and realize them.’

source: ཆོས་ཀྱི་བློ་གྲོས་ཀྱིས་སྨྲས་པ། སྣག་གི་གཉེན་མཚམས་དག་བགྲེས་རབས་དག་བདག་ནི་ཁྱེད་རྣམས་ཐམས་ཅད་ཀྱིས་བྱང་ཆུབ་ཐོབ་པ་ན་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་བསྐུལ་ཏེ། བདག་གིས་བསྐུལ་བས་ཁྱེད་ཐམས་ཅད་ཀྱིས་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་འདི་ལྟར་འདེབས་སོ། །
en: “Dharmamati responded, ‘Kinsmen, I have vowed that when each of you achieves awakening, I will request you to the turn the wheel of Dharma, and that as a result of my request, you will each turn the wheel of Dharma.’

source: ཞི་བའི་བློ་གྲོས་དེ་གཉིས་ཀྱང་སྨོན་ལམ་ཇི་ལྟར་བཏབ་པ་བཞིན་དུ་བཅོམ་ལྡན་འདས་དེས་ལུང་བསྟན་པར་གྱུར་ཏོ། །
en: “Then, Śāntamati, the Blessed One made predictions for the two of them that accorded with the vows they had made.

source: ཞི་བའི་བློ་གྲོས་དེའི་ཚེ་དེའི་དུས་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་ཞེས་བྱ་བར་གྱུར་པ་དེ་ཁྱོད་ཀྱིས་གཞན་ཡིན་པར་དེ་ལྟར་མི་བལྟའོ། །
en: Śāntamati, do not think that he who was at that point the wheel-turning king Dhṛtarāṣṭra is somebody unknown to you.

source: བཅོམ་ལྡན་འདས་མར་མེ་མཛད་དེ་དེའི་ཚེ་དེའི་དུས་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: The Blessed One Dīpaṃkara was at that point the wheel-turning king Dhṛtarāṣṭra.

source: དེའི་བུ་གཞོན་ནུ་སྟོང་ཡོད་པ་དེ་དག་ནི་བསྐལ་པ་བཟང་པོའི་དེ་བཞིན་གཤེགས་པ་ཤ་སྟག་གོ །དེ་བཞིན་གཤེགས་པ་འཁོར་བ་འཇིག་ནས་བཟུང་སྟེ། དེ་བཞིན་གཤེགས་པ་མོས་པ་ཞེས་བྱ་བའི་བར་དག་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་བུ་གཞོན་ནུར་གྱུར་ཏོ། །
en: His thousand sons are all the realized ones of the Fortunate Eon such that those princes are the realized ones from Krakucchanda to Roca.

source: ཞི་བའི་བླ་གྲོས་བཙུན་མོ་མ་སྨད་པ་ཞེས་བྱ་བའི་པང་པ་ནས་རྫུས་ཏེ་བྱུང་བ་ཁྱེའུ་ཆོས་སེམས་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་ནི་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་འདི་ཡིན་ཏེ།
en: Śāntamati, the boy Dharmacinti, who arose spontaneously on the lap of Queen Aninditā, is now Vajrapāṇi, Lord of the Guhyakas.

source: དེའི་ཚེ་དེའི་དུས་ན་ཁྱེའུ་ཆོས་སེམས་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: At that point, he was known as Dharmacinti.

source: ཞི་བའི་བློ་གྲོས་བཙུན་མོ་དཔེ་མེད་མ་ཞེས་བྱ་བའི་པང་པ་ནས་རྫུས་ཏེ་བྱུང་བ་ཁྱེའུ་ཆོས་ཀྱི་བློ་གྲོས་ཞེས་བྱ་བ་དེ་ནི་ཚངས་པ་གཙུག་པུད་ཅན་འདི་ཡིན་ཏེ།
en: Śāntamati, the boy Dharmamati, who arose spontaneously on the lap of Queen Anupamā, is now Brahmā Śikhin.

source: དེའི་ཚེ་དེའི་དུས་ན་ཁྱེའུ་ཆོས་ཀྱི་བློ་གྲོས་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: At that point, he was known as Dharmamati.

source: ཞི་བའི་བློ་གྲོས་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་གི་བཙུན་མོའི་འཁོར་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་དག་ནི་འཁོར་འདིར་འདུས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཡིན་ནོ། །
en: “Śāntamati, all those beings who were women in King Dhṛtarāṣṭra’s inner chambers are now bodhisattvas gathered here in this assembly.

source: རྒྱལ་བུ་གཞོན་ནུ་དེ་རྣམས་ཀྱིས་སེམས་ཅན་གང་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་པ།
en: The princes are all in the process of making beings ready for awakening so that they may achieve unsurpassable and perfect awakening.

source: ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་དེ་དག་ཐམས་ཅད་ནི་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་མཐར་གྱིས་ལུང་བསྟན་པ་ཐོབ་པར་འགྱུར་རོ། །
en: All those who have become firmly established within the Great Vehicle in this Fortunate Eon will eventually receive predictions of their awakening.

source: ཞི་བའི་བློ་གྲོས་འདི་ལྟར་སྐྱེས་བུ་དམ་པ་དེ་དག་གི་བསམ་པ་ཐམས་ཅད་འབྱོར་པས། དགེ་བའི་རྩ་བའི་རྒྱུ་ལས་བྱུང་བའི་སེམས་བསྐྱེད་པ་ཆུད་མི་ཟ་བ་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་མི་འགལ་བ་ལ་ལ་ལྟོས།
en: Śāntamati, since the minds of these good beings are all perfected to such an extent, their conception of the aspiration that arises as a result of the roots of virtue will not go to waste, so long as they are not obstructed by the workings of dependent arising.”

source: ཡུལ་འཁོར་སྲུང་གི་སྔོན་གྱི་ཚུལ་གྱི་ལེའུ་སྟེ་ལྔ་པའོ།། །།
en: This was the fifth chapter, “The Past-Life Story of Dhṛtarāṣṭra.” Chapter 6: The Path of Awakening

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པ་རྣམས་ཀྱང་སེམས་ཅན་ཆེན་པོ་དེ་དག་གི་རྗེས་སུ་བསླབ་པར་བྱའོ། །
en: “Śāntamati, bodhisattvas of great courage who also wish to awaken to unsurpassable and perfect awakening should follow the example of these great beings in this regard.

source: ཚིག་ལྷུར་བླང་བར་མི་བྱའི་བྱང་ཆུབ་ཀྱི་ལམ་ལ་མངོན་པར་བརྩོན་པར་བསྒྲུབ་པ་སྙིང་པོར་བྱའོ། །
en: They should undertake the core practices intent upon the path to awakening and not place their focus on words.

source: དེ་ལ་བྱང་ཆུབ་ཀྱི་ལམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: And what is this path to awakening?

source: བྱམས་པའི་རྗེས་སུ་འབྲང་བའི་སེམས་བསྐྱེད་པས་སེམས་ཅན་ཐམས་ཅད་ལ་ཁོང་ཁྲོ་བ་མེད་པ་དང་།
en: “It eliminates anger toward all beings by cultivating a mind that is suffused with love.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ལ་བརྩོན་པ་དང་།
en: On it one strives to accomplish the perfections.

source: བསྡུ་བའི་དངོས་པོའི་རྗེས་སུ་འབྲང་བ་དང་།
en: One develops the methods of drawing others to oneself.

source: ཚངས་པའི་གནས་པ་བཞི་སྒྲུབ་པ་དང་།
en: One achieves the four dwellings of Brahmā.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལ་མངོན་པར་བརྩོན་པ་དང་།
en: One strives to acquire the constitutive factors of awakening.

source: མངོན་པར་ཤེས་པ་ཡོངས་སུ་སྦྱང་བ་ཡོངས་སུ་བཀང་བ་དང་།
en: One acquires and refines the supernormal faculties.
